fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ГрафикиОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Год = ДатаКакМесяцПредставление(Объект.Год);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	КоличествоДней = Объект.ОтпускаСотрудников;	
		 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания,
		|	РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала, ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания, ДЕНЬ) КАК КоличествоДней
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
		|ГДЕ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
	РезультатЗапроса = Запрос.Выполнить();
	
    Выборка = Запрос.Выполнить().Выбрать();
	
	
	Таблица  = РезультатЗапроса.Выгрузить(); 
	
	КоличествоДней.Загрузить(Таблица);
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ГодПриИзменении(Элемент)
		
	Строка = Формат(Объект.Год, "ДФ='гггг'"); 
	
	ЧислоПроверка = ПроверитьЗначениеНаЧисло(Объект.Год);
	Если ЧислоПроверка = "" Тогда
		Сообщение = Новый СообщениеПользователю;
	    Сообщение.Текст = "Выберите верный формат";
		Сообщение.Сообщить();	
		Отказ = Истина; 
	КонецЕсли;
		
	Число = Число (Строка);  
	
	Если Число > 1900 и Число < 2900 Тогда
	Иначе 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выберите верный год ";
		Сообщение.Сообщить();
		Отказ = Истина; 
	КонецЕсли;

КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников
&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	ОтпускаСотрудниковДатаОкончанияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	ОтпускаСотрудниковДатаНачалаПриИзмененииНаСервере();
КонецПроцедуры
#КонецОбласти



#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьДлительностьОтпуска(Команда)
	ПроверитьДлительностьОтпускаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверитьДлительностьОтпускаНаСервере() экспорт
	ОбъектДок =  РеквизитФормыВзначение("Объект"); 
	Данные = ОбъектДок.ПолучениеДанных();
	
	Если ЗначениеЗаполнено (Данные) Тогда  
		
		// Код для таблицы значений
		ОбъектДок = Объект.Ссылка.ПолучитьОбъект();
		Для Каждого СтрДанные из Данные Цикл 
			СотрудникСверка = СтрДанные.Сотрудник;
			
			Для Каждого ТекущаяСтрока Из ОбъектДок.ОтпускаСотрудников Цикл 
				ЭлементУО = УсловноеОформление.Элементы.Добавить();
				ОформлениеЦветФона = ЭлементУО.Оформление.Элементы.Найти("ЦветФона");   
				ОформлениеЦветФона.Значение = WebЦвета.Красный;
				ОформлениеЦветФона.Использование = Истина;
				//добавляем условие
				ЭлементУсловия 					= ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				//что сравниваем()                                                                                       	
				ЭлементУсловия.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.Сотрудник");
				//как сравниваем
				ЭлементУсловия.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
				//с чем сравниваем
				ЭлементУсловия.ПравоеЗначение 	= Справочники.Пользователи.НайтиПоНаименованию(СотрудникСверка);	
				ЭлементУсловия.Использование	= Истина;
				//оформляемые поля
				ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
				ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковСотрудник"); 
				ЭлементУсловия.Использование		= Истина;
							
			КонецЦикла; 
		КонецЦикла;
	КонецЕсли;
	

КонецПроцедуры



&НаКлиенте
Процедура СформироватьГрафик(Команда)
	АдресПередаваемыхПараметров = ПоместитьЗначенияВХралищие();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Адрес",АдресПередаваемыхПараметров);
	
	//@skip-check notify-description-to-server-procedure
	ОписаниеОповещение = Новый ОписаниеОповещения("ЗаполнитьРезультатОбработкиСервер", ЭтаФорма, СтруктураПараметров);
	
	Попытка
		ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика",СтруктураПараметров,ЭтаФорма,,,,ОписаниеОповещение); 
	Исключение
		ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаДокумента",СтруктураПараметров,ЭтаФорма,,,,ОписаниеОповещение);
	КонецПопытки; 

КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции


&НаСервере
Функция ПоместитьЗначенияВХралищие()
	
	Перем СтруктураПараметров;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Номер",Объект.номер);
	СтруктураПараметров.Вставить("Дата",Объект.Дата);	 
	СтруктураПараметров.Вставить("Год",Объект.Год);
	СтруктураПараметров.Вставить("Ссылка", Объект.Ссылка);
	СтруктураПараметров.Вставить("ДГ", ЭтаФорма.ДГ);
	
	СтруктураПараметров.Вставить("ТабличнаяЧасть",Объект.ОтпускаСотрудников.Выгрузить());
	
	Адрес = ПоместитьВоВременноеХранилище(СтруктураПараметров,Новый УникальныйИдентификатор);
	Возврат Адрес; 
	
КонецФункции 




&НаСервере
Процедура ЗаполнитьРезультатОбработкиСервер(РезультатЗакрытия,Параметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = ПолучитьИзВременногоХранилища(РезультатЗакрытия.Адрес);
	Объект.Дата = СтруктураПараметров.Дата;
	Объект.Номер = СтруктураПараметров.Номер;
	Объект.Год = СтруктураПараметров.Год;
	ЭтаФорма.ДГ = СтруктураПараметров.Диаграмма;
	
	Объект.ОтпускаСотрудников.Загрузить(СтруктураПараметров.ТабличнаяЧасть);
	
КонецПроцедуры

&НаСервере
Функция ДатаКакМесяцПредставление(ДатаДата) Экспорт
	 Строка = Формат(ДатаДата, "ДФ='гггг'");
	 Число = Число (Строка);
	 	
	Возврат Число ;
КонецФункции

&НаКлиенте
Функция ПроверитьЗначениеНаЧисло(СтрокаРазличныеСимволы)

    Если СтрДлина(СтрокаРазличныеСимволы) = 0 Тогда
        Возврат "";
    КонецЕсли;

    РезультатЧисло = "";
    Для а = 1 по СтрДлина(СтрокаРазличныеСимволы) Цикл
        Символ = Сред(СтрокаРазличныеСимволы, а, 1);

        Если Найти("0123456789", Символ) = 0 Тогда
            Продолжить;
        КонецЕсли;

        РезультатЧисло = "" + РезультатЧисло + Символ;
    КонецЦикла;

    Возврат РезультатЧисло;
КонецФункции

&НаСервере
Процедура ЗаписьКоличествоДней()
	
	 	
	КоличествоДней = Объект.ОтпускаСотрудников;	
		 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания,
		|	РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала, ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания, ДЕНЬ) КАК КоличествоДней
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
		|ГДЕ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
	РезультатЗапроса = Запрос.Выполнить();
	
     Выборка = Запрос.Выполнить().Выбрать();
	
	
	Таблица  = РезультатЗапроса.Выгрузить();
	
	
	КоличествоДней.Загрузить(Таблица); 
	
КонецПроцедуры



&НаСервере
Процедура ОтпускаСотрудниковДатаОкончанияПриИзмененииНаСервере()
	Если Объект.Проведен = Истина Тогда	
		Сообщить("Необходимо распровести документ");
		Отказ = Истина; 
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтпускаСотрудниковДатаНачалаПриИзмененииНаСервере()
	Если Объект.Проведен = Истина Тогда	
		
		Сообщить("Необходимо распровести документ");
		Отказ = Истина; 
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры
#КонецОбласти
